           03 CSRGRES.
                05 CUSTOMER-NAME PIC X(50).
                05 CUSTOMER-ID PIC S9(9).
                05 SYS-DATE PIC X(10).
                05 SYS-TIME PIC X(08).
                05 MESSAGES PIC X(100).